{
    "version": "https://jsonfeed.org/version/1",
    "title": "Presbyterian Music Camp",
    "description": "",
    "home_page_url": "https://presbyterian-music-camp.github.io/website",
    "feed_url": "https://presbyterian-music-camp.github.io/website/feed.json",
    "user_comment": "",
    "icon": "https://presbyterian-music-camp.github.io/website/media/website/logo.png",
    "author": {
        "name": "Daniel Eisner"
    },
    "items": [
        {
            "id": "https://presbyterian-music-camp.github.io/website/2018.html",
            "url": "https://presbyterian-music-camp.github.io/website/2018.html",
            "title": "2018",
            "summary": "ThemeSeeing the Forest Through the Trees Seeing the big picture can be a daily challenge&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drmn0ms60\">Theme</h2>\n<p id=\"mcetoc_1drmn0qm61\">Seeing the Forest Through the Trees</p>\n<p>Seeing the big picture can be a daily challenge for many of us, when faced with our own individual realities. Together we CAN learn to see the forest through the trees by taking time out for: community in family; suffering and celebration; and growth through discipline. By taking time to step away from routines and to search for purpose, we can make space for God in our lives. Be prepared to challenge and nurture your body, soul, mind and spirit through music, song, worship and wonder!</p>\n<h2 id=\"mcetoc_1drmn1vl72\">Schedules</h2>\n<p><a href=\"pmc-week-schedule-2018.pdf\">week</a></p>\n<p><a href=\"2018 PMC Schedule.pdf\">workshops</a></p>\n<h2 id=\"mcetoc_1drmnb6dn0\">Other Materials</h2>\n<p><a href=\"Music Camp Handbook 2018.pdf\">handbook</a></p>\n<p><a href=\"Packing List 2018.pdf\">packing list</a></p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-09T20:11:50-05:00",
            "date_modified": "2019-12-09T20:39:31-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/2019.html",
            "url": "https://presbyterian-music-camp.github.io/website/2019.html",
            "title": "2019",
            "summary": "ThemeGrace Notes – Accents of Love for a Hurting World A beautiful piece of music&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drmmlldt0\">Theme</h2>\n<p>Grace Notes – Accents of Love for a Hurting World</p>\n<p dir=\"ltr\">A beautiful piece of music may have grace notes written throughout. When you first learn the piece, you are likely to skip the grace notes, and the music still sounds complete, even without them. But once you know the music better, you realise the composer meant the music to be played with the grace notes included. So you practise with them, and suddenly you realise you had been missing out on a whole other dimension to the music – the grace notes add depth, colour and meaning to the piece, and it is played the way it was meant to be played. So it is with our lives. We can live our lives well enough without ever letting grace in. But God the composer intended our lives to be filled with grace. Once you discover God’s grace and get to know the meaning God has for your life – the purpose of the composer – your life can become deeper and fuller, more as it was meant to be lived, echoing into eternity.</p>\n<p dir=\"ltr\">Come and join us by the trees and the lake, in beautiful Muskoka, and hear the music of grace – God’s accents of love for a hurting world – speak to your soul.</p>\n<h2 id=\"mcetoc_1drmmnuu95\">Schedules</h2>\n<p><a href=\"pmc week schedule 2019.pdf\">week</a></p>\n<p><a href=\"2019 PMC Schedule.pdf\">workshops</a></p>\n<h2 id=\"mcetoc_1drmmn4901\">Other Materials</h2>\n<p><a href=\"Music Camp Handbook 2019.pdf\">handbook</a></p>\n<p><a href=\"Packing List 2019.pdf\">packing list</a></p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-09T20:11:38-05:00",
            "date_modified": "2019-12-09T21:06:44-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/past-years.html",
            "url": "https://presbyterian-music-camp.github.io/website/past-years.html",
            "title": "Past Years",
            "summary": "2019scheduleworkshops",
            "content_html": "<h2 id=\"mcetoc_1drmkoup60\">2019</h2>\n<h3 id=\"mcetoc_1drmkqpjk2\">schedule</h3>\n<h3 id=\"mcetoc_1drmkqnie1\">workshops</h3>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-09T19:55:32-05:00",
            "date_modified": "2019-12-09T19:55:32-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/this-year.html",
            "url": "https://presbyterian-music-camp.github.io/website/this-year.html",
            "title": "This Year",
            "summary": "PMC 2020 takes place August 23rd to 30th! New campers receive a 50% discount this&hellip;",
            "content_html": "<p class=\"align-center\">PMC 2020 takes place August 23rd to 30th!</p>\n<h2 id=\"mcetoc_1drmjpt7g2\">New Camper Promo</h2>\n<p>New campers receive a 50% discount this year! More information will follow.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-09T19:33:29-05:00",
            "date_modified": "2019-12-09T19:41:11-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/tom-gemmell-bursary-application.html",
            "url": "https://presbyterian-music-camp.github.io/website/tom-gemmell-bursary-application.html",
            "title": "Tom Gemmell Bursary Application Process",
            "summary": "Complete an application.Send the application to the convener by May 15th.The camp committee will anonymously review&hellip;",
            "content_html": "<ol>\n<li>Complete an <a href=\"TG_application_v3.1.docx\">application</a>.</li>\n<li>Send the application to the convener by <strong>May 15th</strong>.</li>\n<li>The camp committee will anonymously review all the Tom Gemmell bursary requests we received up to May 15th, and allocate funds. You should hear from us about funding by May 31st.</li>\n<li>If additional campers will accompany you to camp (e.g., family members) and they require bursary support, you may apply for an ASP bursary for these campers. These campers will pay the early bird fee if they register by June 30.</li>\n<li>If you are unable to attend camp for any reason, please let us know as soon as possible so that we can consider reallocating your bursary.</li>\n<li>The camp committee may choose to consider requests received between May 15th and July 31st, if funding permits. The camp committee will not consider any requests received after July 31st.</li>\n</ol>\n<p>If you have any questions about the Tom Gemmell Fund, please send an email to the convener at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a>.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:52:02-05:00",
            "date_modified": "2019-12-08T23:57:17-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/asp-bursary-application.html",
            "url": "https://presbyterian-music-camp.github.io/website/asp-bursary-application.html",
            "title": "ASP Bursary Application Process",
            "summary": "Register for camp.Complete an ASP application form.Send the ASP application and your deposit for camp&hellip;",
            "content_html": "<ol>\n<li><a href=\"https://presbyterian-music-camp.github.io/website/register.html\">Register</a> for camp.</li>\n<li>Complete an <a href=\"ASP_application_generic_2019.doc\">ASP application form</a>.</li>\n<li>Send the ASP application and your deposit for camp fees to the <a href=\"https://presbyterian-music-camp.github.io/website/contact.html\">treasurer</a>. We cannot consider your bursary request unless you have registered and paid the deposit. If you are unable to pay the deposit, please see below for exceptional circumstances.</li>\n<li>On <strong>May 15th</strong> the ASP subcommittee will anonymously review all the ASP bursary requests we received up to that date, and allocate funds. You should hear from us about funding by May 31st. Your camp fees will not increase from the date that you register, even if the fees have gone up by the time we tell you about your funding.</li>\n<li>The maximum amount of a bursary is ½ the early bird registration fee for the appropriate age category, unless there are exceptional circumstances (see below).</li>\n<li><strong>Exceptional Circumstances</strong>: If you believe that you might qualify for more funding (including funding of the deposit if necessary) because of exceptional circumstances, please send an email to <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a> to explain your exceptional circumstances and the amount you are requesting. Your request will be considered anonymously by the ASP subcommittee.</li>\n<li>The registrar will tell you how much funding we can provide, the balance owing, and when you have to make your payment. You can post-date your cheque to August 1st if necessary.</li>\n<li>If you are unable to attend camp because of insufficient bursary funding, we will refund any fees that you paid, including the deposit.</li>\n<li>The ASP subcommittee will consider requests received after May 15th in the order in which we receive them. You will follow the procedure above (register and pay the deposit). You will pay the fee that applies at the time that you register.</li>\n</ol>\n<p>If you have any questions about ASP bursary funding, the application, or need to inform us of a change to your applications, please send an email to <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:46:35-05:00",
            "date_modified": "2019-12-08T23:36:48-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/fund-info.html",
            "url": "https://presbyterian-music-camp.github.io/website/fund-info.html",
            "title": "Fund Info",
            "summary": "Alison Stewart-Patterson FundThis fund was set up many years ago to honour Alison Stewart-Patterson, the&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drk8hcmo1\">Alison Stewart-Patterson Fund</h2>\n<p>This fund was set up many years ago to honour Alison Stewart-Patterson, the founder of music camp. Revenue for the fund comes from earmarked donations, the Sunday worship offering (unless otherwise specified by the donor), tuck profits, and merchandise profits.</p>\n<h2 id=\"mcetoc_1drmj9nie0\">Gladys E. Montgomery Fund</h2>\n<p>Gladys E. Montgomery was a benefactor who loved camping and wanted to make camps more accessible to people who are differently abled. To that end, she bequeathed sums to Presbyterian camps to fund projects for accessibility.</p>\n<h2 id=\"mcetoc_1drk9519d0\">Moncrieff Memorial Fund</h2>\n<p>The Moncrieff Memorial fund originated several years ago to honour Wilf Moncrieff, a former music camper and dean. Revenue for the fund comes from earmarked donations.</p>\n<h2 id=\"mcetoc_1drk9st5r0\">Tom Gemmell Fund</h2>\n<p>Established in grateful memory of The Rev. Dr. Thomas Gemmell, who passed away on May 13, 2012. Tom was a devoted Presbyterian, having served congregations in Whitehorse, Oshawa, St-Laurent, Ajax, and Ottawa. Tom had a deep love of music, and Tom’s family and the Presbyterian Music Camp Committee are convinced that the Tom Gemmell Fund would be an appropriate way to remember Tom and to encourage more people to experience the joy and Christian community life of Presbyterian Music Camp.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:45:57-05:00",
            "date_modified": "2019-12-09T19:29:09-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/living-and-rejoicing-in-christian-community.html",
            "url": "https://presbyterian-music-camp.github.io/website/living-and-rejoicing-in-christian-community.html",
            "title": "Living and Rejoicing in Christian Community",
            "summary": "This article was first published in the July/August edition of Glad Tidings Magazine and is&hellip;",
            "content_html": "<h6 id=\"mcetoc_1drmm0pal0\" class=\"align-center\">This article was first published in the July/August edition of Glad Tidings Magazine and is published here with permission.</h6>\n<h2 id=\"mcetoc_1drk2ks1s0\">First Impressions</h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Stick-House.jpg\" height=\"10em\">The first time that I attended Presbyterian Music Camp I was ten years old. It was 1976, when the camp was still located at the United Church’s Golden Lake Camp. Music Camp had taken to using the last full week of August at the camp, after the young summer campers and their counselors had returned home to get ready for school. We were a little different: our camp included babies, young families, lots of teenagers, couples whose children had grown up and left home, single women in their sixties and seventies; everyone you might meet at your home church!</p>\n<img class=\"post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/Lost-Pilgrims.jpg\" width=\"349\" height=\"262\">\n<p>I don’t remember what the weather was like that year, but I do remember the music and the people. The whole camp worked together all week to present “Jonah-Man Jazz”. Alison Stewart-Patterson, one of the camp’s founders, conducted. I say conducted, but her conducting was more like a larger-than-life dance of joy! (She paid dearly for her extravagance later at a Kangaroo Court, when she had to sit perfectly still in a chair and conduct the camp choir with her pinky fingers. Ouch!) Costumes were created, backdrops were painted, music was practiced, and everyone participated in some way. I was a “wave”, along with a bunch of the other children, but I think I can still sing all of the songs. And while my mind was learning the music, my heart was beginning to learn about Christian community.</p>\n<hr>\n<h2 id=\"mcetoc_1drk2mm2h2\"><strong>The Teen Years</strong></h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/Erin-Brennan.jpg\" alt=\"\" width=\"350\" height=\"262\">Finally, I was in the teen cabin – the land of independence! Funny thing, though – we teens were still very much a part of the camp community; our families were with us, we sang in the camp choir as well as the teen choir, we participated in and even helped lead workshops, we did dishes (singing the whole time!), and we participated in the leadership of morning and evening devotions. We had our own space, but we really belonged in the larger group as well. Our musical role-models were amazing – gifted choral conductors, inspiring song-writers, talented vocalists and instrumentalists – but, more than their talent, these adults were people we respected for their kindness, patience, and their willingness to engage with us. What we learned along the way was that they were inspired by us as well; our energy, our raw talent, our eagerness to learn, our willingness to take risks, and the way we looked after each other and the younger children.</p>\n<p>During my teens, Music Camp was the beginning of my year. I arrived excited to see my friends again and went home emotionally and spiritually renewed for another year at school and church.</p>\n<hr>\n<h2 id=\"mcetoc_1drk2o54u3\"><strong>“The Adults Are Here”</strong></h2>\n<p><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Brass.jpg\" alt=\"\" width=\"349\" height=\"466\">You know you’re not one of the teens anymore when you go down to the campfire at night and someone says, “The adults are here.” Believe me, it comes as a surprise. I’m a little older now, but the same God-filled moments that awed me at camp when I was a teen still give a chill: singing pieces in the camp choir that you can only sing because you have a strength in numbers that most church choirs can only dream of, watching little ones fall asleep cuddled happily in the laps of teenagers they didn’t even know a week ago, walking back to the cabin at night by the light of the Milky Way or even the magical dancing of the aurora borealis, myriad impromptu concerts and, yes, singing by the campfire and laughing with friends well into the night. There are new God-filled moments as well: playing in the concert band with my teen-aged son, the odd calm moment sitting reading or watching the water while the kids are busy with their friends, meeting the children of the kids I used to teach in Children’s Choir, or chatting with old friends who still see the teenager inside me.</p>\n<img class=\"post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/IMG_8348-1024x683.jpg\" width=\"350\" height=\"233\">\n<p>Getting older isn’t all bad. Parents have the special gift of experiencing again some of the things they did when they were young through the eyes of their children. Now I get to watch my son play his beloved bass in the Garage Band, and my older daughter experience the crystalline beauty – and teamwork – of handbell playing. My younger daughter’s smile beams in the Children’s choir and she’s still thrilled by the idea that she gets to buy candy every day at the tuck shop. But my husband and I are still campers, too. He’s bought himself a lovely ukulele and knows enough chords to teach the beginner class. I sing and play my French horn, and have a (very secret) desire to sing with the Garage Band one day.</p>\n<p>Some say they feel camp has started when they experience the Circle and the Flame Sunday evening, with the repeated “Ubi Caritas et Amor, Deus Ibi Est” (Where there is charity and love, there is God) and the lighting of the candles brought by each family to camp. It’s a “coming home” feeling. For me, it comes even earlier – with the grace at dinner. All of the chaos associated with getting three kids and assorted instruments packed, dropping the dog off at the kennel, arranging for house-sitting, planning workshops, etc, etc, is forgotten when we start to sing grace. I think it’s the first moment new campers start to suspect that this might be something different. Everyone is singing – really singing! Not quietly, but strongly – in many-part harmony. The music is beautiful, but this is the first sign of the coming together of this community in Christ.</p>\n<p>The common threads that still bring us together at Music Camp each summer are a love of music and a desire to experience Christian community. There’s something about being in a loving community that opens your heart and changes your perspective. Seeing the wonderful musicians at camp could make me feel inadequate, but instead it inspires me to practice just a little harder. Seeing someone spend an afternoon teaching little kids how to use a fishing rod motivates me to be a little more patient. Seeing the perseverance of campers with health or mobility challenges encourages me never to give up. Hearing someone play banjo in the concert after learning for only a week energizes me to be more courageous. Experiencing the uniqueness that each new camper brings to camp reminds me that we all have sacred gifts and that Christ’s community is for everyone.</p>\n<p><img class=\"post__image post__image--center\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Lake.jpg\" width=\"699\" height=\"524\"></p>\n<p class=\"align-center\">“May you see the face of Christ in everyone you meet, and may everyone you meet see the face of Christ in you.” - Celtic Prayer</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T19:44:09-05:00",
            "date_modified": "2019-12-09T20:17:22-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/contact.html",
            "url": "https://presbyterian-music-camp.github.io/website/contact.html",
            "title": "Contact",
            "summary": "Registrarpmcregistrar@gmail.com pmctreasurer@gmail.com Presbyterian Music Camp C/O St. Paul’s Presbyterian 56 Thames Street S Ingersoll, ON&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drkfdhcg0\">Registrar</h2>\n<p><a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a></p>\n<h2 id=\"mcetoc_1drkficss2\">Treasurer</h2>\n<p><a href=\"mailto:pmctreasurer@gmail.com\">pmctreasurer@gmail.com</a></p>\n<pre>Presbyterian Music Camp<br>C/O St. Paul’s Presbyterian<br><a href=\"https://maps.google.com/?q=56+Thames+Street+S+%0D+%0D+%0D+Ingersoll,+ON+%C2%A0N5C+2S9&amp;entry=gmail&amp;source=g\">56 Thames Street S</a><br>Ingersoll, ON  <a href=\"https://maps.google.com/?q=56+Thames+Street+S+%0D+%0D+%0D+Ingersoll,+ON+%C2%A0N5C+2S9&amp;entry=gmail&amp;source=g\">N5C 2S9</a></pre>\n<h2 id=\"mcetoc_1drkfiafh1\">Convenor</h2>\n<p><a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a></p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-06T00:12:46-05:00",
            "date_modified": "2019-12-08T23:50:34-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/front-page.html",
            "url": "https://presbyterian-music-camp.github.io/website/front-page.html",
            "title": "(front page)",
            "summary": "A community that gathers once a year... Presbyterian Music Camp (PMC) is a family camp that&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drcik51t0\" class=\"align-left\">A community that gathers once a year...</h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/campfire.jpg\" width=\"1080\" height=\"422\"></p>\n<p class=\"align-left\"> </p>\n<p class=\"align-left\">Presbyterian Music Camp (PMC) is a family camp that gathers the third week of August in Muskoka, Ontario.</p>\n<p>Campers find joy in a diversity of ways, but the common thread is the sense of support from the community.</p>\n<p class=\"align-left\">All programming at PMC is run by volunteers within the community, giving rise to a unique dynamic of mentorship.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tlgl0\" class=\"align-right\"> </h2>\n<h2 id=\"mcetoc_1drcp69470\" class=\"align-right\">Are you looking to develop as a musician?</h2>\n<p><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/Handbells-beginner2.jpg\" width=\"3264\" height=\"1635\"></p>\n<p class=\"align-right\"> </p>\n<p class=\"align-right\">PMC has something for every interest and skill level. Workshops include ukelele, choir, handbells, concert band, jazz band, garage band, and drum circle.</p>\n<p class=\"align-right\">Niche musical groups come together and perform at meals, evening programs, or find their own unique venue. PMC has seen barbershop quartets, brass and woodwind quintents, and performances that defy classification.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tobc1\"> </h2>\n<h2 id=\"mcetoc_1drgurl550\">Are you looking to deepen your faith?</h2>\n<img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/candles.jpg\" alt=\"\" width=\"970\" height=\"749\">\n<p> </p>\n<p>Our community supports open conversation about faith and religion and how that looks in campers’ individual lives.<br><br>Each year a unique theme is developed. Morning and evening worships dive into aspects of the theme and offer ideas to use in your everyday life.</p>\n<p>A unique description of the experience can be found <a href=\"https://presbyterian-music-camp.github.io/website/living-and-rejoicing-in-christian-community.html\">here</a>.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tsbb2\" class=\"align-right\"> </h2>\n<h2 id=\"mcetoc_1drh0fakt0\" class=\"align-right\">Are you looking to spend time with you family?</h2>\n<p class=\"align-right\"><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/intergen.jpg\" width=\"1918\" height=\"1360\"></p>\n<p class=\"align-right\"> </p>\n<p class=\"align-right\">As a family camp, PMC's campers come in all ages. Programming, for the most part, invites all ages simultaneously. The result is a uniquely intergenerational environment, though our teens have a particularly strong subculture.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tv5l3\" class=\"align-center\"> </h2>\n<h2 id=\"mcetoc_1drh159i50\" class=\"align-center\">There's more to PMC than can fit here!</h2>\n<p>You can read a more <a href=\"https://presbyterian-music-camp.github.io/website/home.html\">about us</a>, or engage with us directly on <a href=\"https://www.facebook.com/presbyterianmusiccamp/\">Facebook</a> or <a href=\"https://www.instagram.com/pmcmuskoka/\">Instagram</a>, or by <a href=\"https://presbyterian-music-camp.github.io/website/contact.html\">contacting us</a>. Hope to see you!</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-05T21:56:10-05:00",
            "date_modified": "2019-12-09T20:20:47-05:00"
        }
    ]
}
