{
    "version": "https://jsonfeed.org/version/1",
    "title": "Presbyterian Music Camp",
    "description": "",
    "home_page_url": "https://presbyterian-music-camp.github.io/website",
    "feed_url": "https://presbyterian-music-camp.github.io/website/feed.json",
    "user_comment": "",
    "icon": "https://presbyterian-music-camp.github.io/website/media/website/logo.png",
    "author": {
        "name": "Daniel Eisner"
    },
    "items": [
        {
            "id": "https://presbyterian-music-camp.github.io/website/tom-gemmell-bursary-application.html",
            "url": "https://presbyterian-music-camp.github.io/website/tom-gemmell-bursary-application.html",
            "title": "Tom Gemmell Bursary Application",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:52:02-05:00",
            "date_modified": "2019-12-08T21:52:02-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/asp-bursary-application.html",
            "url": "https://presbyterian-music-camp.github.io/website/asp-bursary-application.html",
            "title": "ASP Bursary Application",
            "summary": "Applications for the ASP fund must be received by May 15th to be considered. Applications&hellip;",
            "content_html": "Applications for the ASP fund must be received by May 15th to be considered. Applications received after that date will be considered if funds are still available.",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:46:35-05:00",
            "date_modified": "2019-12-08T21:46:53-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/fund-histories.html",
            "url": "https://presbyterian-music-camp.github.io/website/fund-histories.html",
            "title": "Fund Info",
            "summary": "Alison Stewart-Patterson FundThis fund was set up many years ago to honour Alison Stewart-Patterson, the&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drk8hcmo1\">Alison Stewart-Patterson Fund</h2>\n<p>This fund was set up many years ago to honour Alison Stewart-Patterson, the founder of music camp. The ASP Fund provides bursaries for individuals or families who need financial assistance with camp fees. Revenue for the fund comes from earmarked donations, the Sunday worship offering (unless otherwise specified by the donor), tuck profits, and merchandise profits.</p>\n<h2 id=\"mcetoc_1drk9519d0\">Moncrieff Memorial Fund</h2>\n<p>The Moncrieff Memorial fund originated several years ago to honour Wilf Moncrieff, a former music camper and dean. The Moncrieff fund provides resources to purchase musical instruments for the camp, with a particular focus on rhythm instruments for younger campers. Revenue for the fund comes from earmarked donations.</p>\n<h2 id=\"mcetoc_1drk9st5r0\">Tom Gemmell Fund</h2>\n<p>Established in grateful memory of The Rev. Dr. Thomas Gemmell, who passed away on May 13, 2012. Tom was a devoted Presbyterian, having served congregations in Whitehorse, Oshawa, St-Laurent, Ajax, and Ottawa. Tom had a deep love of music, and Tom’s family and the Presbyterian Music Camp Committee are convinced that the Tom Gemmell Fund would be an appropriate way to remember Tom and to encourage more people to experience the joy and Christian community life of Presbyterian Music Camp.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T21:45:57-05:00",
            "date_modified": "2019-12-08T22:16:30-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/living-and-rejoicing-in-christian-community.html",
            "url": "https://presbyterian-music-camp.github.io/website/living-and-rejoicing-in-christian-community.html",
            "title": "Living and Rejoicing in Christian Community",
            "summary": "First ImpressionsThe first time that I attended Presbyterian Music Camp I was ten years old.",
            "content_html": "<h2 id=\"mcetoc_1drk2ks1s0\">First Impressions</h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Stick-House.jpg\" height=\"10em\">The first time that I attended Presbyterian Music Camp I was ten years old. It was 1976, when the camp was still located at the United Church’s Golden Lake Camp. Music Camp had taken to using the last full week of August at the camp, after the young summer campers and their counselors had returned home to get ready for school. We were a little different: our camp included babies, young families, lots of teenagers, couples whose children had grown up and left home, single women in their sixties and seventies; everyone you might meet at your home church!</p>\n<img class=\"post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/Lost-Pilgrims.jpg\" width=\"349\" height=\"262\">\n<p>I don’t remember what the weather was like that year, but I do remember the music and the people. The whole camp worked together all week to present “Jonah-Man Jazz”. Alison Stewart-Patterson, one of the camp’s founders, conducted. I say conducted, but her conducting was more like a larger-than-life dance of joy! (She paid dearly for her extravagance later at a Kangaroo Court, when she had to sit perfectly still in a chair and conduct the camp choir with her pinky fingers. Ouch!) Costumes were created, backdrops were painted, music was practiced, and everyone participated in some way. I was a “wave”, along with a bunch of the other children, but I think I can still sing all of the songs. And while my mind was learning the music, my heart was beginning to learn about Christian community.</p>\n<hr>\n<h2 id=\"mcetoc_1drk2mm2h2\"><strong>The Teen Years</strong></h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/Erin-Brennan.jpg\" alt=\"\" width=\"350\" height=\"262\">Finally, I was in the teen cabin – the land of independence! Funny thing, though – we teens were still very much a part of the camp community; our families were with us, we sang in the camp choir as well as the teen choir, we participated in and even helped lead workshops, we did dishes (singing the whole time!), and we participated in the leadership of morning and evening devotions. We had our own space, but we really belonged in the larger group as well. Our musical role-models were amazing – gifted choral conductors, inspiring song-writers, talented vocalists and instrumentalists – but, more than their talent, these adults were people we respected for their kindness, patience, and their willingness to engage with us. What we learned along the way was that they were inspired by us as well; our energy, our raw talent, our eagerness to learn, our willingness to take risks, and the way we looked after each other and the younger children.</p>\n<p>During my teens, Music Camp was the beginning of my year. I arrived excited to see my friends again and went home emotionally and spiritually renewed for another year at school and church.</p>\n<hr>\n<h2 id=\"mcetoc_1drk2o54u3\"><strong>“The Adults Are Here”</strong></h2>\n<p><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Brass.jpg\" alt=\"\" width=\"349\" height=\"466\">You know you’re not one of the teens anymore when you go down to the campfire at night and someone says, “The adults are here.” Believe me, it comes as a surprise. I’m a little older now, but the same God-filled moments that awed me at camp when I was a teen still give a chill: singing pieces in the camp choir that you can only sing because you have a strength in numbers that most church choirs can only dream of, watching little ones fall asleep cuddled happily in the laps of teenagers they didn’t even know a week ago, walking back to the cabin at night by the light of the Milky Way or even the magical dancing of the aurora borealis, myriad impromptu concerts and, yes, singing by the campfire and laughing with friends well into the night. There are new God-filled moments as well: playing in the concert band with my teen-aged son, the odd calm moment sitting reading or watching the water while the kids are busy with their friends, meeting the children of the kids I used to teach in Children’s Choir, or chatting with old friends who still see the teenager inside me.</p>\n<img class=\"post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/IMG_8348-1024x683.jpg\" width=\"350\" height=\"233\">\n<p>Getting older isn’t all bad. Parents have the special gift of experiencing again some of the things they did when they were young through the eyes of their children. Now I get to watch my son play his beloved bass in the Garage Band, and my older daughter experience the crystalline beauty – and teamwork – of handbell playing. My younger daughter’s smile beams in the Children’s choir and she’s still thrilled by the idea that she gets to buy candy every day at the tuck shop. But my husband and I are still campers, too. He’s bought himself a lovely ukulele and knows enough chords to teach the beginner class. I sing and play my French horn, and have a (very secret) desire to sing with the Garage Band one day.</p>\n<p>Some say they feel camp has started when they experience the Circle and the Flame Sunday evening, with the repeated “Ubi Caritas et Amor, Deus Ibi Est” (Where there is charity and love, there is God) and the lighting of the candles brought by each family to camp. It’s a “coming home” feeling. For me, it comes even earlier – with the grace at dinner. All of the chaos associated with getting three kids and assorted instruments packed, dropping the dog off at the kennel, arranging for house-sitting, planning workshops, etc, etc, is forgotten when we start to sing grace. I think it’s the first moment new campers start to suspect that this might be something different. Everyone is singing – really singing! Not quietly, but strongly – in many-part harmony. The music is beautiful, but this is the first sign of the coming together of this community in Christ.</p>\n<p>The common threads that still bring us together at Music Camp each summer are a love of music and a desire to experience Christian community. There’s something about being in a loving community that opens your heart and changes your perspective. Seeing the wonderful musicians at camp could make me feel inadequate, but instead it inspires me to practice just a little harder. Seeing someone spend an afternoon teaching little kids how to use a fishing rod motivates me to be a little more patient. Seeing the perseverance of campers with health or mobility challenges encourages me never to give up. Hearing someone play banjo in the concert after learning for only a week energizes me to be more courageous. Experiencing the uniqueness that each new camper brings to camp reminds me that we all have sacred gifts and that Christ’s community is for everyone.</p>\n<p><img class=\"post__image post__image--center\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/6/PMC-Lake.jpg\" width=\"699\" height=\"524\"></p>\n<p class=\"align-center\">“May you see the face of Christ in everyone you meet, and may everyone you meet see the face of Christ in you.” - Celtic Prayer</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-08T19:44:09-05:00",
            "date_modified": "2019-12-08T21:09:26-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/contact.html",
            "url": "https://presbyterian-music-camp.github.io/website/contact.html",
            "title": "Contact",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-06T00:12:46-05:00",
            "date_modified": "2019-12-06T00:12:46-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/front-page.html",
            "url": "https://presbyterian-music-camp.github.io/website/front-page.html",
            "title": "(front page)",
            "summary": "A community that gathers once a year... Presbyterian Music Camp (PMC) is a family camp that&hellip;",
            "content_html": "<h2 id=\"mcetoc_1drcik51t0\" class=\"align-left\">A community that gathers once a year...</h2>\n<p><img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/campfire.jpg\" width=\"1080\" height=\"422\"></p>\n<p class=\"align-left\"> </p>\n<p class=\"align-left\">Presbyterian Music Camp (PMC) is a family camp that gathers the third week of August in Muskoka, Ontario.</p>\n<p>Campers find joy in a diversity of ways, but the common thread is the sense of support from the community.</p>\n<p class=\"align-left\">All programming at PMC is run by volunteers within the community, giving rise to a unique dynamic of mentorship.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tlgl0\" class=\"align-right\"> </h2>\n<h2 id=\"mcetoc_1drcp69470\" class=\"align-right\">Are you looking to develop as a musician?</h2>\n<p><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/Handbells-beginner2.jpg\" width=\"3264\" height=\"1635\"></p>\n<p class=\"align-right\"> </p>\n<p class=\"align-right\">PMC has something for every interest and skill level. Workshops include ukelele, choir, handbells, concert band, jazz band, garage band, and drum circle.</p>\n<p class=\"align-right\">Niche musical groups come together and perform at meals, evening programs, or find their own unique venue. PMC has seen barbershop quartets, brass and woodwind quintents, and performances that defy classification.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tobc1\"> </h2>\n<h2 id=\"mcetoc_1drgurl550\">Are you looking to deepen your faith?</h2>\n<img class=\"post__image post__image--right\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/candles.jpg\" alt=\"\" width=\"970\" height=\"749\">\n<p> </p>\n<p>Our community supports open conversation about faith and religion and how that looks in campers’ individual lives.<br><br>Each year a unique theme is developed. Morning and evening worships dive into aspects of the theme and offer ideas to use in your everyday life.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tsbb2\" class=\"align-right\"> </h2>\n<h2 id=\"mcetoc_1drh0fakt0\" class=\"align-right\">Are you looking to spend time with you family?</h2>\n<p class=\"align-right\"><img class=\"post__image post__image--left\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/4/intergen.jpg\" width=\"1918\" height=\"1360\"></p>\n<p class=\"align-right\"> </p>\n<p class=\"align-right\">As a family camp, PMC's campers come in all ages. Programming, for the most part, invites all ages simultaneously. The result is a uniquely intergenerational environment, though our teens have a particularly strong subculture.</p>\n<hr>\n<h2 id=\"mcetoc_1drk4tv5l3\" class=\"align-center\"> </h2>\n<h2 id=\"mcetoc_1drh159i50\" class=\"align-center\">There's more to PMC than can fit here!</h2>\n<p>You can read a more <a href=\"https://presbyterian-music-camp.github.io/website/home.html\">about us</a>, or engage with us directly on <a href=\"https://www.facebook.com/presbyterianmusiccamp/\">Facebook</a> or <a href=\"https://www.instagram.com/pmcmuskoka/\">Instagram</a>, or by <a href=\"https://presbyterian-music-camp.github.io/website/contact.html\">contacting us</a>. Hope to see you!</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-05T21:56:10-05:00",
            "date_modified": "2019-12-08T21:26:12-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/home.html",
            "url": "https://presbyterian-music-camp.github.io/website/home.html",
            "title": "About",
            "summary": "Presbyterian Music Camp is a week long family camp hosted in Muskoka once a year.",
            "content_html": "<p dir=\"ltr\">Presbyterian Music Camp is a week long family camp hosted in Muskoka once a year. We live as a community and spend the week focusing on growing in faith, as musicians, and as a family. The camp is open to people of all ages and walks of life. All meals are eaten together in a community, and dietary restrictions are accommodated. The camp is open to all, regardless of religious affiliation and beliefs. There are many secular and non-secular activities to partake in, and those who attend for purely musical reasons enjoy the community feel of the camp.</p>\n<p dir=\"ltr\">The week begins with welcoming old friends and new which is followed by a meditative opening ceremony. Each weekday has 5 workshop periods which enable you to sign up for a broad variety of lessons. The workshop leaders are your fellow campers! Some examples of workshop titles are listed below. Each day also includes morning and evening devotions, breakfast, lunch, dinner and snacks. After dinner each evening a unique evening program is held. Look for examples of evening activities below.</p>\n<p dir=\"ltr\">People attending the camp can choose to live in a cabin either with family, friends or on their own. There is a teen cabin (aged 13 to 18), and a young adult cabin (aged 19 to 30s), and many smaller family and single cabins throughout the camp. One of the wonderful parts of the Presbyterian Music Camp community is the intergenerational activities, with the exception of child/teen workshops, anyone is welcome to join workshops. This means there is a diverse spread of knowledge and skills over decades of age differences and walks of life.</p>\n<p dir=\"ltr\">The camp is run fully by volunteers, the organising committee is made up of campers who meet throughout the year to plan various aspects of camp, handle finances, run registration, and make decisions about how the camp is run. The figure heads the week of camp are known as the Deans and are campers who have attended for several years (decades in most cases!), the deans choose a central theme which worship and devotions are based around. Often workshop leaders will pick music often to the theme. The workshop leaders are also fellow campers, these leaders plan in the weeks and months before camp to select music pieces, or workshop activities to run while at camp! There is a camp first-aider who is also attending the camp. While at camp, campers volunteer and are responsible for cleaning common areas and keeping the campus clean. Camp Tamarack comes with a paid kitchen staff who provide all meals and snacks, as well as a cleaning crew who clean bathrooms and showers, and paid lifeguards. </p>\n<h2 id=\"mcetoc_1drchqet83\" dir=\"ltr\">Camp Tamarack</h2>\n<p dir=\"ltr\">Camp Tamarack located north of Bracebridge in the heart of the Muskokas. The site boasts a private lake with a beach and docks, trained lifeguards, canoes and kayaks for use by campers, tennis and basketball courts, soccer field, campfire pits and forests. Buildings on site include a dining hall, large and small performance spaces, new bathroom facilities and private stalled showers, cabins with bunk beds hosting up to 10 music campers at a time. Some cabins are equipped with private bathrooms, and some of the cabins are newly renovated.</p>\n<h2 id=\"mcetoc_1drchqjg64\" dir=\"ltr\">History</h2>\n<p dir=\"ltr\">Back in 1972 the first Music Camp was hosted as a one time event to introduce the new Presbyterian Book of Praise. The idea of the camp was for church organists to become familiar with the new music. Since it was decided to be held in summer the invite was opened to their families as well. Presbyterian Music Camp met that year at a camp on Golden Lake in the Ottawa Valley and it went so well that it was encouraged to be organized again for the following year, and subsequent to follow! This formed a new Christian community brought together by music! By 1990 the camp outgrew its previous site and moved to the current site at Camp Tamarack near Bracebridge, where it is hosted in the last full week of August each summer. The organising committee and staff is made up of dedicated volunteers.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-04T23:13:46-05:00",
            "date_modified": "2019-12-08T21:24:58-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/register.html",
            "url": "https://presbyterian-music-camp.github.io/website/register.html",
            "title": "Register!",
            "summary": "Registering is quick and easy! Click here to Register If you have mobility, health, or&hellip;",
            "content_html": "<p>Registering is quick and easy!</p>\n<p id=\"mcetoc_1dr78andb0\" class=\"align-center\"><a href=\"http://pcc.formstack.com/forms/musiccamp\">Click here to Register</a></p>\n<p>If you have mobility, health, or dietary needs please be <em>very specific</em> so that we can ensure you are placed in accommodations that will suit your needs.</p>\n<h2 id=\"mcetoc_1dr78q3ug1\">Fees</h2>\n<table>\n<tbody>\n<tr>\n<td> </td>\n<td>Before May 15</td>\n<td>Before Aug 15</td>\n<td>Later</td>\n<td>Daily Fee*</td>\n</tr>\n<tr>\n<td>Adult (13+)</td>\n<td>$465</td>\n<td>$485</td>\n<td>$515</td>\n<td>$75</td>\n</tr>\n<tr>\n<td>Youth (4‑12)</td>\n<td>$300</td>\n<td>$320</td>\n<td>$340</td>\n<td>$70</td>\n</tr>\n</tbody>\n</table>\n<p>*Daily fee applies to stays of 3 days or less.</p>\n<p>Children 3 and under are free.</p>\n<h2 id=\"mcetoc_1dr78qin74\">Deposit</h2>\n<p>A non-refundable deposit of $100 per camper is required upon registration in order to complete your registration. Please make all cheques payable to Presbyterian Music Camp.</p>\n<h2 id=\"mcetoc_1dr78t2ct6\">Family Discount</h2>\n<p>A family discount is offered to families based on the number of children and their ages. The table below shows the discount per child, starting with the oldest.</p>\n<table>\n<tbody>\n<tr>\n<td> </td>\n<td>1 (oldest)</td>\n<td>2</td>\n<td>3</td>\n<td>4</td>\n</tr>\n<tr>\n<td>Teen (13‑18)</td>\n<td>$39</td>\n<td>$58.50</td>\n<td>$78</td>\n<td>$97.50</td>\n</tr>\n<tr>\n<td>Youth (4‑12)</td>\n<td>$25</td>\n<td>$37.50</td>\n<td>$50</td>\n<td>$62.50</td>\n</tr>\n</tbody>\n</table>\n<p>The family discount will be applied to an adult or adults coming to camp with multiple children.</p>\n<h2 id=\"mcetoc_1dr79rdv07\">Financial Assistance</h2>\n<p>PMC has a few funds, each with a unique purpose. More background information on them is available <a href=\"https://presbyterian-music-camp.github.io/website/fund-histories.html\">here</a>.</p>\n<h3 id=\"mcetoc_1dr7a5fj79\">Alison Stewart-Patterson Fund</h3>\n<p>The ASP Fund provides bursaries for individuals or families who need financial assistance with camp fees. More information is available <a href=\"https://presbyterian-music-camp.github.io/website/asp-bursary-application.html\">here</a>.</p>\n<h3 id=\"mcetoc_1dr7ae5sca\">Gladys E. Montgomery Fund</h3>\n<p>The GEM Fund provides support for campers with special needs in the form of a stipend for an assistant or caregiver. For inquiries, please contact the registrar at <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>.</p>\n<h3 id=\"mcetoc_1dr7afoeab\">Moncrieff Memorial Fund</h3>\n<p>The Moncrieff Memorial Fund provides resources to purchase musical instruments for the camp, with a particular focus on rhythm instruments for younger campers. For inquiries, please contact the registrar at <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>.</p>\n<h3 id=\"mcetoc_1dr7aktj0c\">Tom Gemmell Fund</h3>\n<p>The Tom Gemmell Fund provides bursaries to cover the cost of attending PMC for one member of the clergy or certified student, and one music director. More information is available <a href=\"https://presbyterian-music-camp.github.io/website/tom-gemmell-bursary-application.html\">here</a>.</p>\n<h2 id=\"mcetoc_1dr7a3lt68\">Questions</h2>\n<p>If you have any questions, please send an email to our registrar at <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2019-12-03T21:10:18-05:00",
            "date_modified": "2019-12-08T21:59:56-05:00"
        }
    ]
}
