{
    "version": "https://jsonfeed.org/version/1",
    "title": "Presbyterian Music Camp",
    "description": "",
    "home_page_url": "https://presbyterian-music-camp.github.io/website",
    "feed_url": "https://presbyterian-music-camp.github.io/website/feed.json",
    "user_comment": "",
    "icon": "https://presbyterian-music-camp.github.io/website/media/website/logo.png",
    "author": {
        "name": "Daniel Eisner"
    },
    "items": [
        {
            "id": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-mar-5-2022.html",
            "url": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-mar-5-2022.html",
            "title": " Board Meeting Summary - Mar 5 2022",
            "summary": "50 YEARS OF HARMONYDid you know? The first year of PMC was 1972, to introduce&hellip;",
            "content_html": "<h2 id=\"mcetoc_1g07maple0\">50 YEARS OF HARMONY</h2>\n<p><em>Did you know?</em></p>\n<p>The first year of PMC was 1972, to introduce the new (then) 1972 Presbyterian Hymn Book. We have planned lots of great stuff to celebrate, like...</p>\n<h3 id=\"mcetoc_1g07mce1i1\">Kitchen Parties</h3>\n<ul>\n<li>Toronto area: July 16</li>\n<li>Ottawa Valley: July 23 (with overnight!)</li>\n<li>Kingston: date TBD</li>\n</ul>\n<p>And maybe other locations, so stay tuned!!</p>\n<h3 id=\"mcetoc_1g07mclt42\">Auction</h3>\n<p>Planning for this event is underway. It will be a live Zoom event sometime in June. To donate an item or service to be auctioned, please contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a>. The plan is to deliver items at camp in August, to avoid shipping charges.</p>\n<h3 id=\"mcetoc_1g07me81l3\">Camp History</h3>\n<ul>\n<li id=\"mcetoc_1g07mi5qv4\">What is your favourite Music Camp memory?</li>\n<li>What is your favourite aspect of Music Camp? [i.e., workshop, activity, sport, etc., and please be specific]</li>\n<li>What else would you like to say about PMC?</li>\n</ul>\n<p>Send your answers by email by <strong>the end of March</strong> to Angus at <a href=\"mailto:ajmacbagpipe@yahoo.com\">ajmacbagpipe@yahoo.com</a></p>\n<h3 id=\"mcetoc_1g07mkttq7\">Home Movies</h3>\n<p>The 50th anniversary committee would love to have a copy of your home movies to show at camp. Digital is preferred, but we aren’t picky. Contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a>.</p>\n<h2 id=\"mcetoc_1g07mnp1b8\">PMC 2022</h2>\n<p>Theme: <strong><em>The Long and Dusty Road: Life as a Pilgrimage.</em></strong></p>\n<p>Dates: <strong>August 21-28</strong></p>\n<p><strong>Registration</strong> is open! Register soon to take advantage of the early bird fee (adults $500, youth $300), and to give us an idea of numbers. Click <a href=\"https://form.jotform.com/220397312266050\">here</a> to go to the registration form.</p>\n<p>If you want to come but can’t quite commit, email the registrar (Cathy Whiteside, <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>) so we know about you.</p>\n<p>Refund policy is on the <a href=\"https://presbyterian-music-camp.github.io/website/register.html\">website registration page</a>.</p>\n<p><strong>Vaccination</strong> for Covid-19 <span style=\"text-decoration: underline;\">will be required</span> to attend PMC in 2022 (with medical exemptions, of course). <strong>Children under 5</strong> will not be required to be vaccinated (since they can’t be yet). If vaccination becomes available for this group before camp, we’ll figure out how it applies.</p>\n<p>The <strong>program and schedule</strong> for 2022 is taking shape. If you’d like to lead a workshop, and you haven’t heard from Jesse Fegelman or his helpers yet, contact Jesse at<br><a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a>.</p>\n<h2 id=\"mcetoc_1g07mvsfh9\">PMC Wear</h2>\n<p>The deadline is May 1 for advance orders for PMC Wear. The logo on all items will be embroidered with the 50th anniversary logo, pictured above. Order ahead for guaranteed availability and size.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2022-04-09T13:47:26-04:00",
            "date_modified": "2022-04-09T13:47:26-04:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-feb-12-2022.html",
            "url": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-feb-12-2022.html",
            "title": " Board Meeting Summary - Feb 12 2022",
            "summary": "PMC 2022Theme: The Long and Dusty Road: Life as a Pilgrimage. Dates: August 21-28 Registration&hellip;",
            "content_html": "<h2 id=\"mcetoc_1ftdr6k7m0\">PMC 2022</h2>\n<p>Theme: <strong>The Long and Dusty Road: Life as a Pilgrimage.</strong></p>\n<p>Dates: <strong>August 21-28</strong></p>\n<p><strong>Registration</strong> is open as of February 19! Register soon to take advantage of the early bird fee (adults $500, youth $300), and to give us an idea of numbers. Click <a href=\"https://presbyterian-music-camp.github.io/website/register.html\">here</a> to go to the registration page.</p>\n<p>If you want to come but can’t quite commit, email the registrar (Cathy Whiteside,<br><a href=\"#INTERNAL_LINK#/post/null\">pmcregistrar@gmail.com</a>) so we know about you.</p>\n<p><strong>Refund policy</strong> is on the <a href=\"https://presbyterian-music-camp.github.io/website/register.html\">registration page</a>; we really hope that we won’t have to cancel camp because of Covid, but the refund policy covers that in case we do.</p>\n<p>Right now, we don’t know if we will be able to have <strong>visitors</strong> to camp. Please be aware that you (or your friends) may not be able to come for the weekend this year, depending on the Covid situation. Check the website closer to camp for information about this.</p>\n<p><strong>Vaccination</strong> for Covid-19 <span style=\"text-decoration: underline;\">will be required</span> to attend PMC in 2022 (with medical exemptions, of course). We have made this decision so that we can provide a camp and program you are used to, and to protect our community, particularly those who cannot be vaccinated yet. More details about this later.</p>\n<p>We’re starting to work on the <strong>program and schedule</strong> for 2022. If you’d like to lead a workshop, contact Jesse Fegelman at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a> before he calls you!</p>\n<h2 id=\"mcetoc_1ftdrdt1a0\">50 YEARS OF HARMONY</h2>\n<p>The 50th Anniversary Committee has been hard at work planning special events to celebrate this milestone on our journey. Some events will happen at camp, but a few things are planned before camp:</p>\n<h3 id=\"mcetoc_1ftdrfijs1\">Kitchen Parties</h3>\n<p>There are 3 parties in the planning stages so far – Ottawa Valley area, Kingston, and Toronto. Dates will be confirmed in early March.</p>\n<h3 id=\"mcetoc_1ftdrfl0h2\">Auction</h3>\n<p>We’re planning an auction as a FUNdraiser. Details and date (likely June) to be confirmed.</p>\n<p>If you want to donate an item or service to be auctioned, please contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a> with the details. The plan is to deliver the item at camp in August, to avoid shipping charges.</p>\n<h2 id=\"mcetoc_1ftdrgv923\">? ? ? ? ? ?</h2>\n<p>Some <strong>questions</strong> for the camp history:</p>\n<ul>\n<li>What is your favourite Music Camp memory?</li>\n<li>What is your favourite aspect of Music Camp? [i.e., workshop, activity, sport, etc., and<br>please be specific]</li>\n<li>What else would you like to say about PMC?</li>\n</ul>\n<p>Many thanks for your input. We’d like to have your input by <strong>the end of March</strong>.</p>\n<p>Please reply to Angus Sutherland at <a href=\"mailto:ajmacbagpipe@yahoo.com\">ajmacbagpipe@yahoo.com</a></p>\n<h2 id=\"mcetoc_1ftdrjuic4\">Music Camp Memories Facebook Group</h2>\n<p>Did you know this group exists? Are you in it? If you’re not, send a request to join. Someone is sure to let you in. And once you’re there, tell all your music camp friends (There are some great photos of people you might recognize when they were much younger – with different hairstyles – and classic clothes.)</p>\n<h2 id=\"mcetoc_1ftdrkru95\">PMC Wear</h2>\n<p>Advance orders for PMC Wear are now available, with a deadline of May 1. Consider this a part of your registration. The logo on all items will be embroidered with the 50th anniversary logo. Details <a href=\"PMC Wear, 2022.pdf\">here</a>.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2022-03-05T15:07:36-05:00",
            "date_modified": "2022-03-05T15:22:13-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-feb.html",
            "url": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-feb.html",
            "title": "Board Meeting Summary - Jan 8 2022",
            "summary": "You didn’t miss the last summary – it never went out. So there’s LOTS to&hellip;",
            "content_html": "<p>You didn’t miss the last summary – it never went out. So there’s LOTS to report in this summary, including:</p>\n<ul>\n<li>PMC 2022<br>\n<ul>\n<li>Theme</li>\n<li>Dates</li>\n<li>Fees</li>\n<li>Registration</li>\n</ul>\n</li>\n<li>50th Anniversary of PMC</li>\n<li>Photo Albums</li>\n</ul>\n<h2 id=\"mcetoc_1frnble3g0\">PMC 2022</h2>\n<p>The <strong>theme</strong> for PMC 2022 is <em><strong>The Long and Dusty Road: Life as a Pilgrimage</strong></em>.</p>\n<p>PMC 2022 will be <strong>August 21-28</strong> at Camp Tamarack.</p>\n<p>We will be raising <strong>registration fees</strong> a bit this year. In the pre-pandemic times, PMC absorbed the cost of HST on your camp fees. Sadly, we are at a stage where we have to raise fees so that we can continue this practice. HST will still be included in your fees, and the new fees are:</p>\n<ul>\n<li>Adult early bird (until May 15): <strong>$500</strong></li>\n<li>Adult regular (May 16-June 28): $525</li>\n<li>Adult just-in-time (June 29 onwards): $550</li>\n<li>Youth (4-12) anytime: <strong>$300</strong> (There’s no increase for youth fees – it isn’t their fault the registration is delayed…)</li>\n</ul>\n<p>Also note the <strong>change in dates</strong> for the second fee increase – to align with when we have to pay our installment to Tamarack.</p>\n<p><strong>Registration</strong> will open in early March, and we have no idea what to expect this year! It would REALLY help us if you could register early (well before the deadline!) to take advantage of the early bird fee, and to give us an idea of our numbers. We don’t want to cancel camp, but we need ~106 campers to break even, and we have to decide in June if camp can go ahead. If you want to come but can’t quite commit, talk to the registrar (Cathy Whiteside, <a href=\"mailto:pmcregistrar@gmail.com\">pmcregistrar@gmail.com</a>) so we know about you.</p>\n<h2 id=\"mcetoc_1frnbsdkp1\">50 YEARS OF HARMONY</h2>\n<p>Hard to believe that PMC has been running for 50 years! We are planning some great things to mark this milestone, including:</p>\n<ul>\n<li>Kitchen parties in the months leading up to camp – if you want to host a kitchen party (doesn’t have to be in your kitchen!), contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a></li>\n<li>A history of camp</li>\n<li>A commissioned song</li>\n</ul>\n<p>It’s not too late to contribute your ideas for the celebration. Contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a> with your suggestions.</p>\n<p>Part of this process includes sifting through a treasure trove if archival information – old brochures, photos, merchandise, other memorabilia. If you have something that fits here, contact MJ at <a href=\"mailto:presbyterianmusiccamp@gmail.com\">presbyterianmusiccamp@gmail.com</a>.</p>\n<h2 id=\"mcetoc_1frnbvo6a4\">???</h2>\n<p>We have misplaced the photo albums. If you have them, or know where they are, send a message to Alison Cooper (<a href=\"mailto:m.alison.cooper@gmail.com\">m.alison.cooper@gmail.com</a>)</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2022-02-12T11:16:44-05:00",
            "date_modified": "2022-03-05T15:07:46-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/black-lives-matter-statement.html",
            "url": "https://presbyterian-music-camp.github.io/website/black-lives-matter-statement.html",
            "title": "Black Lives Matter Statement",
            "summary": "Presbyterian Music Camp (PMC) affirms unequivocally that Black Lives Matter. Racism and systemic injustice in&hellip;",
            "content_html": "<strong>Presbyterian Music Camp (PMC)</strong> affirms unequivocally that Black Lives Matter. Racism and systemic injustice in any form is antithetical to <strong>PMC</strong>’s purpose and values. <strong>PMC</strong> promises to do our best to, and to continue to learn how to, be a part of the work to eliminate structural racism and white supremacy in all of the spaces of our camp and the rest of our lives.",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-11-28T18:01:08-05:00",
            "date_modified": "2021-11-28T18:01:08-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/covenant.html",
            "url": "https://presbyterian-music-camp.github.io/website/covenant.html",
            "title": "Covenant",
            "summary": "PMC Covenant (Code of Conduct) By participating in PMC, you agree to its Covenant. Treat others&hellip;",
            "content_html": "<p><span class=\"text-huge\"><strong>PMC Covenant (Code of Conduct)</strong></span></p>\n<p>By participating in <strong>PMC</strong>, you agree to its Covenant. </p>\n<ol>\n<li>Treat others as you would like to be treated, both online and in person.</li>\n<li>Help create a safe, inclusive and fun environment for all.</li>\n<li>Treat <strong>Tamarack</strong> and <strong>PMC</strong> staff and volunteers with respect and appreciation.</li>\n<li>Respect the privacy and security of other campers’ cabins and other campers in your cabin.</li>\n<li>Be mindful of other campers’ need for quiet and sleep.</li>\n<li>Demonstrate care and respect for instruments, equipment, property and the environment.</li>\n<li>Report anything that concerns you to a <strong>PMC</strong> Board member or trusted adult.</li>\n</ol>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-11-28T18:00:16-05:00",
            "date_modified": "2021-11-28T18:00:16-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/anti-harassment-policy.html",
            "url": "https://presbyterian-music-camp.github.io/website/anti-harassment-policy.html",
            "title": "Anti-Harassment Policy",
            "summary": "Presbyterian Music Camp (PMC) is committed to providing a safe and inclusive environment, free from&hellip;",
            "content_html": "<p><strong>Presbyterian Music Camp (PMC) </strong>is committed to providing a safe and inclusive environment, free from discrimination and harassment, where all people are treated with respect and dignity. Harassment is illegal under Canadian and Ontario law. <strong>PMC </strong>maintains a zero-tolerance policy for harassment on any basis, including age, ancestry, colour, race, citizenship, ethnic origin, place of origin, creed/religion, disability, record of offences, family status, marital status, sex, gender identity, gender expression, sexual orientation and socio-economic class.</p>\n<p>This policy applies to all participants of <strong>PMC</strong>, including board members, staff, volunteers, campers, visitors and guests. Preventing harassment is the obligation of everyone in the organization. This policy applies to all behaviour that is in some way connected to <strong>PMC</strong>, including during off-site meetings, special events, excursions (eg. Tim Horton’s runs) and on-site social gatherings. This also applies to <strong>PMC</strong>’s virtual activities, including online communications and all video/voice/chat platforms (eg. Zoom and Discord).</p>\n<p>All harassment complaints involving <strong>PMC </strong>participants will be treated seriously and handled in a timely manner with due diligence, compassion, respect and confidentiality.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-11-28T17:59:49-05:00",
            "date_modified": "2021-11-28T17:59:49-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/welcome-statement.html",
            "url": "https://presbyterian-music-camp.github.io/website/welcome-statement.html",
            "title": "Welcome Statement",
            "summary": "The Presbyterian Music Camp community endeavours to be a safe and welcoming place for everyone,&hellip;",
            "content_html": "<p>The Presbyterian Music Camp community endeavours to be a safe and welcoming place for everyone, from newborns to seniors. Where you are coming from, or where you’re headed to; your past experiences, your dreams for the future; your deepest fears, and your highest hopes, are all a part of who you are and you are welcome in the community that is music camp.</p>\n<p>You are welcome with your unique background, heritage and culture. Black Lives Matter. Every Child Matters. Indigenous Peoples and People of Colour are part of our community. We celebrate our diversity which is a reflection of our Creator.</p>\n<p>You are welcome if you are single, married, divorced, separated, widowed; whether you live in a family formed by birth, by chance or by choice; whether you have children or not; if you bring children or not; if your children are clinging to your leg all week or you to have tear them away from their new camp family at the end of the week. This is a family camp and families come in all forms.</p>\n<p>You are welcome if you are lesbian, gay, bisexual, transgender, queer, intersex, Two-Spirit, asexual, pansexual, cisgender, non-binary, or are just learning what most of those terms mean. People of all sexual orientations, gender identities, and gender expressions belong in the PMC community.</p>\n<p>You are welcome with all of your physical, emotional and intellectual needs. We consider accessibility in all its forms, and we strive with all our creativity to meet your needs within the rocky forest setting that we love.</p>\n<p>You are welcome whether or not you are Presbyterian, if you don’t like “organized religion”, if you bring with you another religious tradition, if you have no faith background, or if you can’t remember the last time you were in a place of worship. We are all on a journey, and we are glad that you have chosen to walk with us for a time.</p>\n<p>You are welcome if this is your very first music camp or you have been coming your whole life; whether you make your living in music, or your musical ability is mostly wishful thinking; whether you can carry the whole section, or can’t carry a note in a basket. Music can be enjoyed by everyone.</p>\n<p>You are welcome if you prefer shopping bags to sleeping bags, cuddling your teddy bear to a morning dip in the lake, and milk foam in latte to marshmallows in cocoa.</p>\n<p>We welcome tree huggers, banjo players, bagpipers, seekers, doubters, bleeding hearts… and YOU!</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-11-28T17:58:04-05:00",
            "date_modified": "2021-11-28T17:58:04-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/this-year-3.html",
            "url": "https://presbyterian-music-camp.github.io/website/this-year-3.html",
            "title": "2021",
            "summary": " Camp will be presented from the evening of Sunday, August 22 through to Saturday, August&hellip;",
            "content_html": "<h6 id=\"mcetoc_1fb390dkk0\" class=\"align-center\"> </h6>\n<p>Camp will be presented from the evening of Sunday, August 22 through to Saturday, August 28.</p>\n<p><img class=\"post__image post__image--center\" src=\"https://presbyterian-music-camp.github.io/website/media/posts/43/pmc-trinity.png\" alt=\"\" width=\"602\" height=\"602\"></p>\n<h2 id=\"mcetoc_1fb398uof1\">Theme</h2>\n<p>In Paul’s letter to the Corinthians, he sends a very clear message. With both simplicity and brevity, he states that faith, hope, and love are, as he describes them, the choicest of graces. In this famous verse of Scripture, the words, often quoted at weddings, and printed, have hit a chord in the modern world. With this phrase, Paul wraps up this section explaining why godly, self-sacrificing love is required to fully express spiritual gifts. He concludes by mentioning love again with two other virtues often listed with it: faith and hope. Together, these three virtues \"abide\" or \"remain.\" They are eternal.</p>\n<p>Throughout this protracted time of COVID isolation we have all needed to lean on our faith, to find hope when others around us may have none, and to respond with love in a hardening world. As a community, when we are at camp (I mean on the ground, walking the dusty road camp) theses graces are in abundance. The camp experience we often find inexplicable, is a manifestation of, the synergy of the gathering of people in the name of Jesus Christ.</p>\n<p>During this 2021 virtual camp experience we hope you are able to reflect on the words of Paul. This is an opportunity to share how faith, hope, and love have played a part in our lives, how they have helped us with the challenge of a pandemic, and how we can make these graces the tenets of our future. </p>\n<h2 id=\"mcetoc_1fb39a10c3\">Schedule</h2>\n<p>The schedule is available <a href=\"https://calendar.google.com/calendar/u/0/embed?src=47lmlug9dndktfcplq96rfndi0@group.calendar.google.com&amp;ctz=America/Toronto\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>!</p>\n<p>Anything before about 11:00 will be pre-recorded.</p>\n<h2 id=\"mcetoc_1fb39emmh5\">Deadlines</h2>\n<table>\n<tbody>\n<tr>\n<td>Date</td>\n<td>What</td>\n</tr>\n<tr>\n<td>Aug 6</td>\n<td><a href=\"https://docs.google.com/document/d/1Z10jqwk5k1Mla9g3MiKYYEtQpCaf1GYN3Uw2-32_5lw/edit?usp=sharing\" target=\"_blank\" rel=\"noopener noreferrer\">Sign up for Variety House</a></td>\n</tr>\n<tr>\n<td>Aug 9</td>\n<td>Videos for Ubi Caritas and Land Acknowledgements – see Discord for instructions</td>\n</tr>\n<tr>\n<td>Aug 15</td>\n<td>Videos for Variety House due – watch Discord for information on how to submit</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"mcetoc_1fcj49chk1\">Discord</h2>\n<p>We’ve mentioned Discord a few times now. If you haven’t used it since last year (or ever!) don’t despair, help is on the way.</p>\n<p>If you used Discord last year, it should be there waiting for you this year. You might need to get the app again if you deleted it.</p>\n<p>If you’ve never been on Discord before, join with <a href=\"https://discord.gg/TBapR3w\" target=\"_blank\" rel=\"noopener noreferrer\">this invite link</a>!</p>\n<p>It’s free, it’s fun, it’s where all the cool kids are!!!</p>\n<p>A lot of people use Discord for all kinds of things besides Music Camp, and they often want to be somewhat anonymous; this is great, but on the PMC server, please use your real name so we know who you are.</p>\n<p>Also, a note about Discord notifications: you might want to turn these on before camp starts – either for everything, or for specific channels. In Discord, find Notification Settings on your device, and set it up so it works for you. You might also have to go to Settings on your device to allow notifications from Discord.</p>\n<h2 id=\"mcetoc_1fbssh9os0\">Group Gatherings</h2>\n<p><span style=\"font-weight: 400;\">IF Covid rules allow for a gathering in your area, invite some PMC friends over and share the LOVE.</span></p>\n<p><strong>Remember</strong><span style=\"font-weight: 400;\">: outside is always better, respect the numbers, mask if you have/want to, follow the rules.</span></p>\n<h2 id=\"mcetoc_1fcj2sfhj0\">Registration</h2>\n<p>With a virtual camp, there is no Registration, and very little cost…BUT</p>\n<ul>\n<li>This is PMC’s second year with no income.</li>\n<li>We have some ongoing expenses – like website hosting fees, Zoom account fees, CCLI license.</li>\n<li>We anticipate that there will be increased interest in bursaries when we return to in-person camp.</li>\n</ul>\n<p>If you can (and only if you can) please consider making a small donation to the Alison Stewart Patterson fund for camp bursaries so we can go into next year in a healthy position. Our suggestion is $10 for an individual or $25 for a family, but you can donate more, or less, it’s up to you.</p>\n<p>If you’ve already paid for registration, you can request a refund, or redirect your payment to the ASP bursary fund.</p>\n<p>To make a donation: do an e-transfer to pmctreasurer@gmail.com with the security question: what is this payment for and the security answer: aspfund</p>\n<p>For any other financial transactions, contact the treasurer at <a href=\"mailto:pmctreasurer@gmail.com\">pmctreasurer@gmail.com</a></p>\n<p>Thank you for your support of the PMC ministry!</p>\n<h2 id=\"mcetoc_1fbsrt0an2\">Mailing List</h2>\n<p>We know there are lots of people in your life who would LOVE PMC. This is a great year to introduce them to all we have to offer, because there’s no</p>\n<ul>\n<li>Packing</li>\n<li>Driving</li>\n<li>Cabins</li>\n</ul>\n<p>Add your music teacher, choir director, best friend to the mailing list (with their permission, of course), so they can get all the news about Music Camp Trinity and join in. Send a message with the person’s name and email address to <a href=\"mailto:m.alison.cooper@gmail.com\">Alison Cooper</a>.</p>\n<h2 id=\"mcetoc_1fb39fntf6\">Land Acknowledgement</h2>\n<p>We plan to have a Land Acknowledgement as part of our opening ceremonies – but we know we are all over Ontario (and maybe even further afield) so there are lots of Indigenous peoples to include. If you are interested in presenting a personal Land Acknowledgement as part of the opening ceremonies for Music Camp Trinity, contact <a href=\"mailto:audetam@gmail.com\">Anne Audet</a> to find out how you can participate.</p>\n<h2 id=\"mcetoc_1fb39kb7d8\"> </h2>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-11-28T11:10:30-05:00",
            "date_modified": "2021-11-28T11:10:30-05:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-oct-23-2021.html",
            "url": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-oct-23-2021.html",
            "title": " Board Meeting Summary - Oct 23 2021",
            "summary": "To all the leaders of PMC Trinity for making our second virtual camp sing. To&hellip;",
            "content_html": "<p>To all the leaders of PMC Trinity for making our second virtual camp sing.</p>\n<p>To all the behind-the-scenes people who ran tech, interference, and the ice cream machine.</p>\n<p>To all the Board members, for your ongoing commitment to PMC.</p>\n<p>AND to all the campers who continue to support PMC through these tough times.</p>\n<p>After a well-deserved September off, the PMC Board met on October 23. Some of us were on Zoom, and some were together again. It felt great (and a bit odd) to see some folks live again.</p>\n<p>We spent some time at our first Board meeting on feedback. We plan to develop some of the great ideas for camp 2022, but we have all agreed:</p>\n<h4 id=\"mcetoc_1fj251ofa1\" class=\"align-center\">NO 3PEAT!</h4>\n<p> </p>\n<p>PMC 2022 is booked at Tamarack from August 21-28. We are pulling out all the stops to make this an IN-PERSON, F2F, real live camp, because…</p>\n<h3 id=\"mcetoc_1fj252quk2\" class=\"align-center\">2022 is the</h3>\n<h2 id=\"mcetoc_1fj253dpu3\" class=\"align-center\">50TH ANNIVERSARY</h2>\n<h3 id=\"mcetoc_1fj253jfa4\" class=\"align-center\">of PMC</h3>\n<p>PMC started in 1972, back when the summer and winter Olympics were in the same year. The same year that Watergate began.</p>\n<p>There is an Anniversary Sub-committee brainstorming ideas for this celebration. Contact MJ if you’d like to help, with the subject line PMC - 50 years of harmony (<a href=\"mailto:m.j.perry@mac.com\">m.j.perry@mac.com</a>)</p>\n<p>Introducing your (mostly the same) Board for 2021-2022</p>\n<table>\n<tbody>\n<tr>\n<td><strong>Role</strong></td>\n<td> </td>\n</tr>\n<tr>\n<td>Chair</td>\n<td>Taras Broadhead</td>\n</tr>\n<tr>\n<td>PCC Liaison</td>\n<td>Doug Kendall</td>\n</tr>\n<tr>\n<td>Secretary</td>\n<td>Alison Cooper</td>\n</tr>\n<tr>\n<td>Treasurer</td>\n<td>Debi Vanderstelt</td>\n</tr>\n<tr>\n<td>Administration/Procedures</td>\n<td>Marilyn Broadhead</td>\n</tr>\n<tr>\n<td>Advertising/Social Media</td>\n<td>Kaitlin Audet</td>\n</tr>\n<tr>\n<td>Camp Liaison</td>\n<td>Anne Audet</td>\n</tr>\n<tr>\n<td>Dean</td>\n<td>David Linderman</td>\n</tr>\n<tr>\n<td>Dean</td>\n<td>Hugh Donnelly</td>\n</tr>\n<tr>\n<td>Registrar</td>\n<td>Cathy Whiteside</td>\n</tr>\n<tr>\n<td>Staffing/Scheduling</td>\n<td>Jesse Fegelman</td>\n</tr>\n<tr>\n<td>Youth Representative</td>\n<td>Katie Duncan</td>\n</tr>\n<tr>\n<td>Youth Representative</td>\n<td>?</td>\n</tr>\n<tr>\n<td>Tech Manager</td>\n<td>Daniel Eisner</td>\n</tr>\n<tr>\n<td>Merchandise</td>\n<td>Cathy Whiteside</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Liz Gautreau</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Ian MacCready</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Cynthia McMinn</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Beth Ronaghan</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Lois Rooney-Giurin</td>\n</tr>\n<tr>\n<td>Director at Large</td>\n<td>Lindsay Weidelich</td>\n</tr>\n<tr>\n<td>Other Committee</td>\n<td>Bradley Audet</td>\n</tr>\n<tr>\n<td>Other Committee</td>\n<td>Gayle Atkinson</td>\n</tr>\n<tr>\n<td>Other Committee</td>\n<td>MJ Perry</td>\n</tr>\n</tbody>\n</table>\n<p>There are lots of people involved throughout the year to plan PMC, but new faces are always welcome, particularly as we plan for our 50th anniversary. If you’d like to share your knowledge, skills, and enthusiasm, contact Taras (<a href=\"mailto:taras.broadhead@gmail.com\">taras.broadhead@gmail.com</a>) or Marilyn (<a href=\"mailto:marilyn.broadhead@gmail.com\">marilyn.broadhead@gmail.com</a>). Distance is not a barrier with Zoom.</p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-10-27T20:44:23-04:00",
            "date_modified": "2021-10-27T20:45:51-04:00"
        },
        {
            "id": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-june-12-2021.html",
            "url": "https://presbyterian-music-camp.github.io/website/board-meeting-summary-june-12-2021.html",
            "title": " Board Meeting Summary - June 12 2021",
            "summary": "We have a theme for virtual PMC! Music Camp Trinity: Faith, Hope, and Love The&hellip;",
            "content_html": "<p>We have a theme for virtual PMC!</p>\n<p class=\"align-center\">Music Camp Trinity: Faith, Hope, and Love</p>\n<p>The dates are August 22 – 29.</p>\n<p>We are developing the schedule in the next few weeks. There will be some <strong>repeat performances</strong> of the things you love best, some <strong>updated versions</strong> of your favourite activities, and we have some great ideas for <strong>completely new programs</strong>! More info will be available soon!</p>\n<p>If you want to participate in leadership or behind the scenes, please let us know! Send a message to <a href=\"mailto:m.alison.cooper@gmail.com\">m.alison.cooper@gmail.com</a> to discuss what you can help with.</p>\n<p><strong><u>Memorial for Marc Cooper</u></strong></p>\n<p>Camp Tamarack is planning the Marc Cooper Virtual Tribute Event on <strong>June 22 from 7:30 – 8:30</strong> PM. Go to <a href=\"https://www.facebook.com/camptamarackcanada\" >Camp Tamarack’s Facebook page</a> to get the link for this event. </p>\n<p>The PMC Board has contributed to this memorial event. We are also in the early stages of planning something for our virtual camp. We’ll have more information soon. </p>",
            "author": {
                "name": "Daniel Eisner"
            },
            "tags": [
            ],
            "date_published": "2021-06-14T18:15:36-04:00",
            "date_modified": "2021-06-14T18:15:36-04:00"
        }
    ]
}
