[
  {
    "name": "Swimming and Canoeing",
    "location": "The Beach",
    "age": "All",
    "desc": "Beach fun from 2:15 - 4:45!",
    "period": "2:15pm - 4:45pm"
  },
  {
    "name": "Children's Games",
    "location": "Harmony House",
    "age": "5+",
    "desc": "Games and outdoor activities taking advantage of what the site and staff have to offer.",
    "period": "2"
  },
  {
    "name": "Crafts for Kids",
    "location": "Harmony House",
    "age": "All",
    "desc": "Different crafts every day.\n\nChildren under the age of 7 need to be accompanied by an adult.",
    "period": "3"
  },
  {
    "name": "Kids' Camp Memories",
    "location": "Harmony House",
    "age": "5+",
    "desc": "Scrapbooking and more!",
    "period": "5"
  },
  {
    "name": "Banjo",
    "location": "MacDonald Meeting Room",
    "age": "13+",
    "desc": "This is a safe space for banjo players and enthusiasts to escape persecution and learn styles and techniques on a 5 string instrument.",
    "period": "1"
  },
  {
    "name": "Children's Choir",
    "location": "Harmony House",
    "age": "6-12",
    "desc": "A choir for children, aged 6-12.  Sing fun songs with your friends and see how much fun a choir can be!",
    "period": "1"
  },
  {
    "name": "Sport of the Day",
    "location": "Various Outdoors",
    "age": "All",
    "desc": "Sport and location will be announced at lunch.",
    "period": "3"
  },
  {
    "name": "Cherubs",
    "location": "The Nest Basement",
    "age": "up to 5",
    "desc": "A fun place for toddlers and pre-schoolers to play and laugh while their parents do Workshops in Other Locations or just hang out with their kids and other parents.",
    "period": "1"
  },
  {
    "name": "Cherubs (continued)",
    "location": "The Nest Basement",
    "age": "up to 5",
    "desc": "A fun place for toddlers and pre-schoolers to play and laugh while their parents do Workshops in Other Locations or just hang out with their kids and other parents.",
    "period": "2"
  },
  {
    "name": "Bible Study",
    "location": "The Nest 2F Meeting Room",
    "age": "13+",
    "desc": "Daily discussion based on the theme for each day. Could include hymns too?",
    "period": "4"
  },
  {
    "name": "Intermediate Ukulele",
    "location": "The Nest 2F Meeting Room",
    "age": "10+",
    "desc": "Take your ukulele playing to the next level!",
    "period": "5"
  },
  {
    "name": "Camp Choir",
    "location": "Rec Hall",
    "age": "13+",
    "desc": "Four-part singing for campers of any musical ability. Music reading is not required.",
    "period": "1"
  },
  {
    "name": "Concert Band",
    "location": "Rec Hall",
    "age": "13+",
    "desc": "Instrumental music for woodwinds, brass & percussion – bring your own instrument, and a music stand if you have one.",
    "period": "2"
  },
  {
    "name": "90s Garage Band",
    "location": "Rec Hall",
    "age": "13+",
    "desc": "Get out your flannel and torn jeans, dye and spike your hair, or just come to jam out to some 90s tunes.",
    "period": "4"
  },
  {
    "name": "Beginner Hand Bells",
    "location": "The Nest - \"Tern\" Room B01",
    "age": "13+",
    "desc": "An introduction to playing hand bells in a group.",
    "period": "4"
  },
  {
    "name": "Celtic Session",
    "location": "Bluevale Deck",
    "age": "13+",
    "desc": "This workshop will focus on learning an Irish jig. Topics include learning by ear as well as adding traditional ornamentation. This is an instrumental workshop, most suited for wind or stringed instruments capable of playing a single melody line.",
    "period": "4"
  },
  {
    "name": "Intermediate Hand Bells",
    "location": "The Nest - \"Tern\" Room B01",
    "period": "5",
    "age": "13+",
    "desc": "TBD"
  },
  {
    "name": "Late Night Jazz Jam",
    "location": "The Nest Basement",
    "period": "9pm (W/Th)",
    "desc": "Play some Jazz tunes with the astounding PMC Jazz Collective.",
    "age": "13+"
  },
  {
    "name": "Create & Relate",
    "location": "Varies",
    "period": "Varies",
    "desc": "Less structured crafting & conversation.  Listen for an announcement at meal times or ask.",
    "age": "13+"
  },
  {
    "name": "Stargazing",
    "desc": "After dark one evening, join a session of amateur astronomy and admire the night sky through a telescope. Listen for announcements for time and location for this.",
    "location": "Outdoors",
    "period": "Evening",
    "age": "13+"
  },
  {
    "name": "Beginner/Early Recorder + Ukulele",
    "location": "Bluevale Deck",
    "age": "6+ (adult accompaniment required under age 6)",
    "desc": "Beginner/Early Recorder (1st half hour) - You can bring your own recorder or use one provided at beginner recorder. Workshops are only 30 minutes long.\n\nBeginner Ukulele (2nd half hour) - The goal of beginner ukulele is to have fun. We'll learn a little musicianship while we're singing familiar songs and practicing a handful of the most common ukulele chords. No previous experience required. Please bring a ukulele, but if you don't have one we have some you can borrow. Workshops are only 30 minutes long.",
    "period": "5"
  },
  {
    "name": "Strings",
    "location": "The Nest Basement",
    "age": "All",
    "desc": "Dust off your violins, violas and cellos! This is a reading-based workshop for string ensemble. We will try to accommodate all ages and levels, but some playing and reading experience on your instrument is necessary.",
    "period": "4"
  },
  {
    "name": "Drum Circle",
    "location": "Rec Hall",
    "age": "8+",
    "desc": "Learn the basics of hand drumming. Bring your djembes and other drums if you have them.  If not, we have a few loaners.",
    "period": "5"
  },
  {
    "name": "Advanced Choir",
    "location": "The Nest Basement",
    "age": "13+",
    "desc": "This year's Advanced Choir repertoire will include a spiritual from the Georgia Sea Islands, a reimagined setting of The Times They Are A-Changin' and more! Suitable for singers who read music.",
    "period": "3"
  },
  {
    "name": "Adult Crafts - 3D Needle Felting (M-Th)",
    "location": "The Nest 2F Meeting Room",
    "age": "14+",
    "desc": "Learn how to create a small sculpture through needle felting.  Basic animal project will be suitable for beginners.  Instructions on how to create a sculpture with an armature will allow more advanced students to try something more.  Students must be prepared to potentially prick themselves!\n\n12 attendees total.  Supplies will be provided.",
    "period": "3"
  },
  {
    "name": "Intermediate Guitar",
    "location": "MacDonald Meeting Room",
    "age": "13+",
    "desc": "Expand your knowledge of chords and the guitar neck with accessible shapes and songs to play them.",
    "period": "2"
  },
  {
    "name": "Beginner Guitar",
    "location": "Bluevale Deck",
    "age": "10+",
    "desc": "Learn your first guitar songs along with chords and strumming patterns.",
    "period": "3"
  },
  {
    "name": "Mindfulness / Relaxation",
    "location": "The Nest 2F Meeting Room",
    "period": "2",
    "desc": "Mindfulness (3 days - weather dependent)  - This workshop is for the mind, body and spirit as we explore ways to calm the nervous system. As a group we will relax, share, breathe, walk, create, appreciate, learn, experience and connect with ourselves, with each other and with nature.  A yoga mat or blanket may be used on one or more days.\n\nRelaxation (2 days) - Take some time for yourself and enjoy guided relaxations.\n\nNote: Listen for an announcement at breakfast on which option will run on each day.",
    "age": "18+"
  },
  {
    "name": "Swing Dance",
    "location": "Rec Hall",
    "age": "TBD",
    "desc": "Learn to dance to vintage jazz music from the 1930s and 40s! We'll be teaching the Lindy Hop -- a partnered dance that was popular back in that time and has seen a comeback in the past few decades. The focus will be on teaching basic moves and dance vocabulary to let you improvise and have fun on the social dance floor, rather than on preparing a choreographed routine. You don't need to bring a dance partner (you can if you want though), as we'll be rotating partners every few minutes during the workshop.",
    "period": "3"
  },
  {
    "name": "Polyphonic and Chant Choir",
    "location": "The Nest Basement",
    "age": "13+",
    "desc": "Come explore the world of unaccompanied polyphony and sacred chant, with music from both eastern and western Christian traditions! Singers should be comfortable reading music and open to trying something new and probably esoteric.",
    "period": "5"
  },
  {
    "name": "Adult Crafts - Calligraphy",
    "location": "Harmony House",
    "age": "13+",
    "desc": "5 days of learning the basics of calligraphy.  Please bring your own pens: a broad nibbed black marker or a refillable ink pen (such as a Sheaffer) for those with more experience.  Along with your pen, you should bring a pencil, eraser, and ruler.",
    "period": "4"
  },
  {
    "name": "Book Club",
    "location": "MacDonald Meeting Room",
    "age": "13+",
    "desc": "Contemporary Fiction: The Briar Club, by Kate Quinn\nCanadian Author: Crow Lake, by Mary Lawson\nYA Fiction: The Siren, by Kiera Cass\nClassic: Pride and Prejudice, by Jane Austen\nFriday BYOB Bonus: Bring Your Own Book! Come share a bit about a favourite book that you always recommend to other readers, or chat about whatever you are currently reading!\n\nListen for an announcement at lunch for the book/category of the day.",
    "period": "3"
  },
  {
    "name": "Mental Health Workshop (cont.)",
    "location": "MacDonald Meeting Room",
    "age": "13+",
    "desc": "The continuation of Expressive Art Experience (M/W/F).  Workshop runs from 3:15pm - 4:50pm.",
    "period": "5"
  },
  {
    "name": "Mental Health Workshop (M/W/F)",
    "location": "MacDonald Meeting Room",
    "age": "13+",
    "desc": "Therapeutic expressive art experience.  More detail to follow.  Note: limit of 15 campers at each session.  The workshop will begin at 3:15pm and continue until 4:50pm.  A detailed description is available on the sign-up sheet in the dining hall.\n\nSupported in part by a bequest to The Presbyterian Church in Canada.\n",
    "period": "4"
  }
]
